app/Http/Controllers/Api/PostController.php

select * from `posts`
---
    public function index()
    {
        return PostResource::collection(Post::all());

select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function show($id)
    {
        //return new PostResource(Post::with('author')->with('category')->with('comments')->findOrFail($id));
        return new PostResource(Post::findOrFail($id));