app/Http/Controllers/Api/UserController.php

    public function index()
    {
        return UserResource::collection(User::all()) ;
---
select * from `users` where `users`.`deleted_at` is null

    public function update(UpdateUserRequest $request, User $user)
    {
        $user->update($request->validated());
---
update `users` set `email` = 'kate_kate@gmail.com', `users`.`updated_at` = '2022-06-13 21:29:39' where `id` = 14