<?php
echo '<h2>Напишите регулярное выражение для проверки:</h2><br>';
//task 1
echo 'Пример 1: http://example.com/ - Доменных имен для протоколов http и https, с необязательным слешем в конце. Специальные символы не используются.<br>';
$pattern= '~https?:\/\/\w+\.\w+\/?~';
$hosts = ['http://example.com/', 'https://regex101.com/', 'https://github.com/'];
echo "шаблон поиска — $pattern <br>";
foreach ($hosts as $host){
    echo "$host — ";
    if(preg_match($pattern, $host)){
        echo 'совпадение найдено <br>';
    }
}
echo '<br><br>';

//task 2
echo 'Пример 2: даты: 2012/09/18 12:10.<br>';
$pattern = '/(20|19)\d{2}\/(0[0-9]|1[0-2])\/(0[1-9]|1[0-9]|2[0-9]|3[0-1])\s(0[0-9]|1[0-9]|2[0-3]):([0-5][0-9])/';
$dates = ['2012/09/18 12:10',
    '2022/02/29 11:15',
    '1945/12/32 11:15',
    '1845/13/30 11:15',
    '1945/10/30 01:15',
    '1945/10/05 19:15',
    '1945/10/05 19:15',
    '1945/10/05 23:59'];
echo "шаблон поиска — $pattern <br>";

foreach ($dates as $date) {
    if (preg_match($pattern, $date)){
        echo "дата $date — совпадение найдено<br>";
    } else echo "дата <b>$date</b> — совпадение не найдено<br>";
}
echo '<br><br>';

//task3
echo 'Пример 3: Адрес в формате: г. Минск, ул. Основателей, дом 53, кв. 3 PS>естественно адрес может быть любой<br>';
//шаблон для проверки
$pattern = '~г\.?\s?[А-Я][а-я]+,\sул\.\s?[А-Я][а-я]+,\s?(д|дом)\.?\s?\d{1,3},\s?(кв\.?|квартира)\s?\d{1,4}~u';
//массив адресов
$adresses = ['г. Минск, ул. Основателей, дом 53, квартира 3',
    'г.Москва, ул.Пензенская, д. 155, кв.34',
    ];
echo "шаблон поиска — $pattern <br>";
//поиск совпадений
foreach ($adresses as $adress) {
    if (preg_match($pattern, $adress)){
        echo "адрес $adress — совпадение найдено<br>";
    } else echo "адрес <b>$adress</b> — совпадение не найдено<br>";
}