app/Observers/UserObserver.php

select * from `users` where `is_admin` = 1 and `users`.`deleted_at` is null
---
    public function created(User $user)
    {
        $admins = User::where('is_admin', true)->get();