app/View/Composers/BlogViewComposer.php

    public function compose(View $view)
    {
        $view->with('popularPost', Post::published()->orderBy('views', 'desc')->take(3)->get());
        $view->with('recommendedPost', Post::published()->where('is_recommended', true)->take(3)->get());
        $view->with('recentPost', Post::published()->orderBy('date', 'desc')->take(4)->get());
        $view->with('categories', Category::all());
---
select * from `posts` order by `views` desc limit 3
select * from `posts` where `is_recommended` = 1 limit 3
select * from `posts` order by `date` desc limit 4
select * from `categories`