app/Http/Controllers/Frontend/SubscribeController.php

insert into `subscriptions` (`email`, `token`, `updated_at`, `created_at`) values ('e.v.khliabets@gmail.com', 'TmSqUh9jiTfHJ5A24zGzkHVZEKDLAZclSYUiZxme', '2022-05-21 16:38:27', '2022-05-21 16:38:27')
---
    public function subscribe(SubscribeSubscriptionRequest $request)
    {
        $subscriber = Subscription::create($request->validated());

select * from `subscriptions` where `token` = 'BCpEGf5H8Ic2BbeDMp2nu5sufBQrhwvxDS7jSIb1' limit 1
---
    public function verification($token)
    {
        $subscriber = Subscription::where('token', $token)->firstOrFail();