app/Http/Controllers/CountryController.php

select * from `cities` where `cities`.`country_id` = 1 and `cities`.`country_id` is not null
select * from `countries`
---
    public function showPopulation()
    {
        $countries = Country::with(['cities' => function ($query) {
            $query->where('population', ">=", "100000");
        }])->get();