app/Http/Controllers/FeedbackController.php

    public function showFeedback($id){
        $feedbacks = Feedback::where('user_id', $id)->get();
---
select * from `feedbacks` where `user_id` = '2'