app/Http/Controllers/HomeController.php

select * from `posts` where `is_publish` = 1 limit 2 offset 2
select count(*) as aggregate from `posts` where `is_publish` = 1
---
    public function index()
    {
        $posts = Post::where('is_publish', true)->paginate(2);

select * from `tags` where `slug` = 'slag_tega_3' limit 1
select `posts`.*, `post_tag`.`tag_id` as `pivot_tag_id`, `post_tag`.`post_id` as `pivot_post_id` from `posts` inner join `post_tag` on `posts`.`id` = `post_tag`.`post_id` where `post_tag`.`tag_id` = 3 limit 2 offset 0
select count(*) as aggregate from `posts` inner join `post_tag` on `posts`.`id` = `post_tag`.`post_id` where `post_tag`.`tag_id` = 3
---
    public function tag($slug)
    {
        $tag = Tag::where('slug', $slug)->firstOrFail();

        $posts = $tag->posts()->paginate(2);

select * from `categories` where `slug` = 'slag_kategorii_1' limit 1
select * from `posts` where `posts`.`category_id` = 1 and `posts`.`category_id` is not null limit 2 offset 0
select count(*) as aggregate from `posts` where `posts`.`category_id` = 1 and `posts`.`category_id` is not null
---
    public function category($slug)
    {
        $category = Category::where('slug', $slug)->firstOrFail();

        $posts = $category->posts()->paginate(2);