app/Models/Feedback.php

select * from `users` where `users`.`id` = 1 limit 1
---
    protected function body(): Attribute
    {
        return Attribute::make(
            get: function ($value) {
                $user = User::find($this->id)->first();