app/Models/Post.php

update `posts` set `is_publish` = 0, `posts`.`updated_at` = '2022-05-02 09:44:42' where `id` = 9
---
    public function publish()
    {
        $this->is_publish = true;
        $this->save();

update `posts` set `is_recommended` = 0, `posts`.`updated_at` = '2022-05-02 09:39:43' where `id` = 8
---
    public function recommend()
    {
        $this->is_recommended = true;
        $this->save();

update `posts` set `category_id` = '1', `posts`.`updated_at` = '2022-05-04 18:18:05' where `id` = 6
insert into `post_tag` (`post_id`, `tag_id`) values (6, 1)
---
    public function setCategory($id)
    {
        if ($id == null) {
            return;
        }

        $this->category_id = $id;
        $this->save();
    }

    /*public function setTags($ids)
    {
        if ($ids == null) {
            return;
        }

        $this->tags()->sync($ids);

select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` = 5
---
    public function getTagsTitles()
    {
        if (!$this->tags->isEmpty()) {
            return implode(', ', $this->tags->pluck('title')->all());

select max(`id`) as aggregate from `posts` where `id` < 1
---
    public function hasPrevious()
    {
        return self::where('id', '<', $this->id)->published()->max('id');

select * from `posts` where `posts`.`id` = 2 limit 1
select min(`id`) as aggregate from `posts` where `id` > 1
---
    public function hasNext()
    {
        return self::where('id', '>', $this->id)->published()->min('id');

select * from `posts` where `posts`.`id` = 1 limit 1
---
    public function getPrevious()
    {
        $postID = $this->hasPrevious();
        return self::find($postID);

select * from `posts` where `posts`.`id` = 4 limit 1
---
    public function getNext()
    {
        $postID = $this->hasNext();
        return self::find($postID);

select * from `posts`
---
    public function related()
    {

        return self::published()->get()->except($this->id);