app/Providers/AppServiceProvider.php

    public function boot()
    {
        view()->composer('pages._sidebar', function ($view){
            $view->with('popularPost', Post::orderBy('views', 'desc')->take(3)->get());
            $view->with('recommendedPost', Post::where('is_recommended', true)->take(3)->get());
            $view->with('recentPost', Post::orderBy('date', 'desc')->take(4)->get());
            $view->with('categories', Category::all());
---
select * from `posts` order by `views` desc limit 3
select * from `posts` where `is_recommended` = 1 limit 3
select * from `posts` order by `date` desc limit 4
select * from `categories`