app/Providers/ViewServiceProvider.php

    public function boot()
    {
        View::composer(["pages._sidebar", 'weather.index'], BlogViewComposer::class);

        view()->composer('admin._sidebar', function ($view){
            $view->with('newCommentsCount', \App\Models\Comment::where('is_publish', false)->count());
---
select count(*) as aggregate from `comments` where `is_publish` = 0