app/Http/Controllers/Admin/CategoryController.php

select * from `categories` limit 2 offset 0
select count(*) as aggregate from `categories`
---
    public function index(IndexCategoryRequest $request)
    {
        $categories = Category::paginate(2);

insert into `categories` (`title`, `slug`, `updated_at`, `created_at`) values ('2121', '2121', '2022-04-19 21:12:29', '2022-04-19 21:12:29')
---
    public function store(StoreCategoryRequest $request)
    {
        $request->validated();

        Category::create($request->all());

delete from `categories` where `id` = 13
---
    public function destroy(Category $category, DestroyCategoryRequest $request)
    {
        $category->delete();