app/Http/Controllers/Admin/CommentController.php

    public function index()
    {
        $comments = Comment::all();
---
select * from `comments`