app/Http/Controllers/Admin/PostController.php

    public function index()
    {
        $posts = Post::all();
---
select * from `posts` where `posts`.`deleted_at` is null

    public function create()
    {
        $categories = Category::pluck('title', 'id')->all();
        $tags = Tag::pluck('title', 'id')->all();
---
select `title`, `id` from `categories`
select `title`, `id` from `tags`

    public function store(StorePostRequest $request)
    {
        //dd($request->validated());
        $post = Post::create($request->validated());

        $post->setCategory($request->get('category_id'));
        $post->setTags($request->get('tags'));
        $post->toggleRecommend($request->get('is_recommended'));
        $post->togglePublish($request->get('is_publish'));
---
insert into `posts` (`title`, `content`, `date`, `image`, `slug`, `updated_at`, `created_at`) values ('post 1', 'content post 1', '2022-05-16', 'uploads/LncKG751RyMmAarlApkjC2dKIVwRvoJCs3BvlpM3.jpg', 'post-1', '2022-05-02 09:19:22', '2022-05-02 09:19:22')
update `posts` set `is_published` = 0, `is_recommended` = 0, `posts`.`updated_at` = '2022-05-04 21:25:42' where `id` = 5

    public function edit(Post $post)
    {
        $categories = Category::pluck('title', 'id')->all();
        $tags = Tag::pluck('title', 'id')->all();
        $post_tag = $post->tags->pluck('id')->all();
---
select `title`, `id` from `categories`
select `title`, `id` from `tags`
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` = 6

    public function update(UpdatePostRequest $request, Post $post)
    {
        $post->update($request->validated());

        $post->setCategory($request->get('category_id'));
        $post->setTags($request->get('tags'));
---
update `posts` set `image` = 'uploads/ccQdAc9gtNdSad3UQgyQ3QNqIUZY01BeOsor5dWs.jpg', `posts`.`updated_at` = '2022-05-02 09:39:43' where `id` = 8
select * from `post_tag` where `post_tag`.`post_id` = 1

    public function destroy(Post $post)
    {
        $post->delete();
---
delete from `posts` where `id` = 9