app/Http/Controllers/Admin/PostController.php

select * from `posts` limit 2 offset 2
select count(*) as aggregate from `posts`
---
    public function index(IndexPostRequest $request)
    {
        $posts = Post::paginate(2);

select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` = 6
---
    public function edit(EditPostRequest $request, Post $post)
    {
        $categories = Category::pluck('title', 'id')->all();
        $tags = Tag::pluck('title', 'id')->all();
        $selectedTags = $post->tags->pluck('id')->all();