app/Http/Controllers/Admin/SubscriptionController.php

    public function index()
    {
        $subscriptions = Subscription::all();
---
select * from `subscriptions`

    public function store(StoreSubscriptionRequest $request)
    {
        Subscription::create($request->validated());
---
insert into `subscriptions` (`email`, `token`, `updated_at`, `created_at`) values ('e.v.khliabets@gmail.com', '', '2022-05-21 22:14:58', '2022-05-21 22:14:58')

    public function destroy(Subscription $subscription)
    //public function destroy($subscription)
    {
        $subscription->delete();
---
delete from `subscriptions` where `id` = 5