app/Http/Controllers/Admin/TagController.php

select * from `tags` limit 2 offset 0
select count(*) as aggregate from `tags`
---
    public function index(IndexTagRequest $request)
    {
        $tags = Tag::paginate(2);

insert into `tags` (`title`, `slug`, `updated_at`, `created_at`) values ('тег номер 7', 'teg-nomer-7', '2022-04-21 17:21:09', '2022-04-21 17:21:09')
---
    public function store(StoreTagRequest $request)
    {
        Tag::create($request->validated());