app/Http/Controllers/Admin/TagController.php

    public function update(UpdateTagRequest $request, Tag $tag)
    {
        $tag->update($request->validated());
---
update `tags` set `title` = 'тэг 11122222', `tags`.`updated_at` = '2022-04-21 17:33:13' where `id` = 10