app/Http/Controllers/Admin/UserController.php

    public function index(IndexUserRequest $request)
    {
        $users = User::paginate(2);
---
select * from `users` where `users`.`deleted_at` is null

    public function store(StoreUserRequest $request)
    {
        $user = User::create($request->validated());
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('fdgdf', 'e.v.khliabets2wwww@gmail.com', '$2y$10$TaBMuqfBpos5I9DNZ1wv6.sMhzqUjEq4jN2yp7HvNDttGLVjxmBpa', '2022-05-03 13:51:58', '2022-05-03 13:51:58')

    public function update(UpdateUserRequest $request, User $user)
    {
        $user->update($request->validated());
---
update `users` set `password` = '', `users`.`updated_at` = '2022-04-26 12:22:06' where `id` = 5

    public function destroy(DestroyUserRequest $request, User $user)
    {
        $user->delete();
---
update `users` set `deleted_at` = '2022-04-27 10:21:56', `users`.`updated_at` = '2022-04-27 10:21:56' where `id` = 6