app/Http/Controllers/Admin/UserController.php

    public function update(UpdateUserRequest $request, User $user)
    {
        $user->update($request->validated());
---
update `users` set `deleted_at` = '2022-04-26 21:35:41', `users`.`updated_at` = '2022-04-26 21:35:41' where `id` = 6