<?php
    echo "Создать объект СТРАНА (Country)<br><br>
Приватные свойства:
- Название (name)
- Население (population) (массив из объектов ЧЕЛОВЕК)<br><br>

Публичные методы:
- Получить количество населения (getPopulation)
- Получить средний возраст населения (getAverageAge)<br><br>
Создать объект ЧЕЛОВЕК (Human)<br><br>
Приватные свойства:
- Имя (name)
- Возраст (age)<br><br>

Публичные методы:
- Установить имя (из массива)
- Установить возраст (рандомно)<br><br>
Приватные методы проверки имени и возраста:
- checkName() предусмотреть проверку в приватном методе человека установку имени только строки - использовать в сеттере имени данный приватные метод проверки
- checkAge() предусмотреть проверку в приватном методе человека возраста от 1 года до 110 лет (проверка на число и значения в диапазоне) - использовать в сеттере возраста данный приватный метод проверки<br><br>
Создать минимум 6 человек. и реализовать выше описанную логику в классах<br><br>";

